package pm;

public class Exam5 {
	public static void main(String[] args) {
		// 메소드는 클래스의 기능에 해당하는 요소이다.
		// 먹기, 잠자기, 공부하기, 전진하기, 후진하기..
		
		// 접근제어자		리턴타입		매개변수(인수)
		// public static int sum(int a, int b){
		//					메소드명
		// return a;
		// }
		
		// 메소드명은 관례적으로 소문자로 작성하고 소괄호 안에는 입력 매개변수로
		// 메소드를 호출할 때 전달되는 값의 자료형과 값을 저장할 지역 변수명을 정의한다.
		// 입력되는 값으로 int 형 2개를 입력받아 처리하는 sum이라는 이름의 메소드이고
		// 출력되는 결과 즉 리턴값의 자료형은 int 이고 접근은 public으로 선언되어있다.
		
		// 메소드 호출
		// 메소드도 클래스의 멤버이므로 객체 안에 존재한다.
		// 클래스 외부에서 메소드를 사용하려면 객체를 먼저 생성해야 한다.
	}
}
